Repository: stoletnaedine/get-better-ios
Catalog: Classes/Resources/*.lproj/Localizable.strings
Languages: ru

source: Success
ru: Успешно

source: Cancel
ru: Отмена

source: OK
ru: Хорошо

# Share.text
source: 💜 Tips of the Day in GetBetter #getbetterapp
ru: 💜 Советы дня в приложении GetBetter #getbetterapp

# TabBar.lifeCircle
source: Wheel
ru: Колесо

# TabBar.journal
source: Journal
ru: Дневник

# TabBar.addPost
source: New Post
ru: Новый пост

# TabBar.achievements
source: Achievements
ru: Достижения

# TabBar.settings
source: Settings
ru: Настройки

# Sphere.relations
source: Relations
ru: Отношения

# Sphere.health
source: Health
ru: Здоровье

# Sphere.environment
source: Environment
ru: Окружение

# Sphere.finance
source: Finance
ru: Финансы

# Sphere.work
source: Work
ru: Работа

# Sphere.relax
source: Rest
ru: Отдых

# Sphere.creation
source: Creativity
ru: Творчество

# Sphere.spirit
source: Spirituality
ru: Духовность

# Sphere.relations.desc
source: Relationship with a partner, love
ru: Взаимоотношения с партнером, любовь

# Sphere.health.desc
source: Energy, wellness, well-being
ru: Энергия, оздоровление, самочувствие

# Sphere.environment.desc
source: Children, parents, relatives, close friends
ru: Дети, родители, родственники, близкие друзья

# Sphere.finance.desc
source: Income, expenses, liabilities, assets
ru: Доходы, расходы, пассивы, активы

# Sphere.work.desc
source: Place of work, professional skills, career growth
ru: Место работы, профессиональные навыки, карьерный рост

# Sphere.relax.desc
source: Brightness of life, communication, travel, entertainment, sleep
ru: Яркость жизни, общение, путешествия, развлечения, сон

# Sphere.creation.desc
source: Potential realization, hobbies, personal development
ru: Реализация потенциала, хобби, личностное развитие

# Sphere.spirit.desc
source: Emotions, state of mind, meditations
ru: Эмоции, душевное состояние, медитации

# Sphere.relations.question
source: How many points would you rate your relationship with a loved one, close people within the family?
ru: На сколько баллов ты бы оценил свои отношения с любимым человеком, близкими людьми внутри семьи?

# Sphere.health.question
source: How many points would you rate your well-being? Do you play sports? What is your attitude to health?
ru: На сколько баллов ты бы оценил своё самочувствие? Занимаешься ли спортом? Какое у тебя отношение к здоровью?

# Sphere.environment.question
source: How many points would you rate your relationship with your parents, children, relatives, close friends?
ru: На сколько баллов ты бы оценил свои отношения с родителями, детьми, родственниками, близкими друзьями?

# Sphere.finance.question
source: How many points would you estimate your income, assets? How well do you know about finance?
ru: На сколько баллов ты бы оценил свои доходы, активы? Насколько хорошо ты разбираешься в финансах?

# Sphere.work.question
source: How many points would you rate your place of work, professional skills, career growth?
ru: На сколько баллов ты бы оценил своё место работы, профессиональные навыки, карьерный рост?

# Sphere.relax.question
source: How many points would you rate the brightness of your life, communication, travel, entertainment, quality of sleep?
ru: На сколько баллов ты бы оценил яркость своей жизни, общение, путешествия, развлечения, качество сна?

# Sphere.creation.question
source: How many points would you rate the realization of your potential, hobbies, personal development?
ru: На сколько баллов ты бы оценил реализацию своего потенциала, занятия хобби, личностное развитие?

# Sphere.spirit.question
source: How many points would you rate your emotions, state of mind? Do you practice meditation? After all the ratings, click Save.
ru: На сколько баллов ты бы оценил свои эмоции, душевное состояние? Практикуешь ли медитации? После всех оценок нажми Сохранить.

# LifeCircle.loading
source: Loading...
ru: Загрузка...

# LifeCircle.circle
source: Wheel
ru: Колесо

# LifeCircle.metrics
source: Metrics
ru: Метрики

# LifeCircle.current
source: Current
ru: Текущее

# LifeCircle.start
source: Initial
ru: Начальное

# Common.events
source: entries
ru: записей

# Common.average
source: average score
ru: средний балл

# Common.days
source: days
ru: дней

# Journal.alert.deletePost
source: Are you sure you want to delete this post?
ru: Удалить пост?

# Journal.alert.delete
source: Delete
ru: Удалить

# Journal.deletedPost
source: Post deleted
ru: Пост удалён

# Journal.placeholder
source: Your journal posts will be here. Each of them will pump up the wheel of life. Try adding the first entry.
ru: Здесь будут посты твоего дневника. Каждый из них будет прокачивать колесо жизни. Попробуй добавить первую запись.

# Journal.tipOfTheDay
source: Tip of the Day
ru: Совет дня

# Journal.edit
source: Edit
ru: Редактировать

# Journal.search
source: Search by text, sphere, date
ru: Поиск

# Achievements.title
source: Achievements
ru: Достижения

# Achievements.regular.few.description
source: Add events %d in a row (%d/%d)
ru: Добавлять события %d дня подряд (%d/%d)

# Achievements.regular.many.description
source: Add events %d in a row (%d/%d)
ru: Добавлять события %d дней подряд (%d/%d)

# Achievements.regularFive.title
source: High five!
ru: Дай пять!

# Achievements.regularSeven.title
source: Week of Achievements
ru: Неделя достижений

# Achievements.maxValue.lock.title
source: Achieved
ru: Прокачано

# Achievements.maxValue.lock.description
source: Upgrade any sphere up to 10 points
ru: Прокачать любую сферу до 10 баллов

# Achievements.maxValue.unlock.title
source: %@ to maximum
ru: %@ на максимум

# Achievements.maxValue.unlock.description
source: Excellent work! Sphere %@ leveled 10 points
ru: Отличная работа! Сфера %@ прокачена на 10 баллов

# Achievements.looser.title
source: Goodbye Looser
ru: Прощай, лузер

# Achievements.looser.lock.description
source: Exit the red zone in any sphere
ru: Выйти в любой сфере из красной зоны

# Achievements.looser.unlock.description
source: %@: is no longer in the red zone
ru: %@: теперь не в красной зоне

# Achievements.rocket.lock.description
source: Achieve 1 point in any area in less than %d days
ru: Набрать 1 балл в любой сфере меньше, чем за %d дней

# Achievements.rocket.unlock.description
source: %@: got %d points faster than %d days
ru: %@: набрал %d балл быстрее, чем за %d дней

# Achievements.roundCount.title
source: Round Number
ru: Круглая цифра

# Achievements.roundCount.lock.description
source: Write %d posts
ru: Написать %d постов

# Achievements.roundCount.unlock.description
source: You have already written %d posts
ru: Ты написал уже %d постов

# Tips.title
source: My Tips of the Day
ru: Мои советы дня

# Tips.ifEmpty
source: Tips of the day you liked will be here.
ru: Здесь будут советы дня, которым ты поставил лайк.

# NoInternet.Title
source: Oops, where's the internet?
ru: Упс, а где интернет?

# NoInternet.Notice
source: The application cannot work without the Internet.
ru: Без интернета приложение не сможет работать.

# NoInternet.Button
source: Retry
ru: Повторить

# NoInternet.tryConnectAlert
source: Trying to connect
ru: Пробую подключиться

# Auth.enterEmail
source: Enter your E-mail
ru: Введи E-mail

# Auth.password
source: Password
ru: Пароль

# Auth.enterPassword
source: Please enter your password
ru: Введи пароль

# Auth.enter
source: Login
ru: Войти

# Auth.doRegister
source: Register
ru: Зарегистрироваться

# Auth.forgotPassword
source: I forgot my password
ru: Не помню пароль

# Auth.register
source: Registration
ru: Регистрация

# Auth.successRegister
source: You are registered 🤟
ru: Вы зарегистрировались 🤟

# Auth.anonymButton
source: Continue without registering
ru: Продолжить без регистрации

# emailIsEmpty
source: Please enter your E-mail
ru: Введи E-mail

# emailIsNotValid
source: Please enter a valid E-mail
ru: Введи корректный E-mail

# passwordIsEmpty
source: Please enter your password
ru: Введи пароль

# ResetPassword.alertEmail
source: The letter was sent to your E-mail. Check your mail
ru: Письмо отправлено на E-mail. Проверь почту

# ResetPassword.title
source: Reset Password
ru: Сбросить пароль

# ResetPassword.button
source: Reset Password
ru: Сбросить пароль

# ResetPassword.noticeLabel
source: A link will be sent to the specified E-mail, by which you can set a new password
ru: На указанный E-mail придёт ссылка, по которой ты сможешь задать новый пароль

# Register.successAlert
source: You have successfully registered
ru: Вы успешно зарегистрировались

source: Error
ru: Ошибка

# Error.NoInternet
source: No network connection
ru: Нет подключения к сети

# Error.default.message
source: Something went wrong. Please try again
ru: Что-то пошло не так. Попробуйте снова

# Profile.editTitle
source: Edit
ru: Редактировать

# Profile.signOut
source: Sign Out
ru: Выйти

# Profile.update
source: Update
ru: Обновить

# Profile.name
source: Name
ru: Имя

# Profile.enterName
source: Please enter a name
ru: Введи имя

# Profile.enterEmail
source: Please enter your E-mail
ru: Введи E-mail

# Profile.password
source: Password
ru: Пароль

# Profile.enterPassword
source: Please enter a new password
ru: Введи новый пароль

# Profile.loadAvatar
source: Load avatar
ru: Загрузить аватар

# Profile.warning
source: After changing your E-mail, you will need to re-enter the application
ru: После смены E-mail необходимо будет заново войти в приложение

# Profile.loading
source: Please wait, loading in progress
ru: Подождите, идет загрузка

# Profile.successEdit
source: Profile updated
ru: Профиль обновлён

# Onboarding.save
source: Save
ru: Сохранить

# Onboarding.exit
source: Exit
ru: Отмена

# Onboarding.emptyValuesWarning
source: All questions must be answered first
ru: Сначала нужно ответить на все вопросы

# Onboarding.10
source: 10 — is perfect
ru: 10 — идеально

# Onboarding.9
source: 9 - excellent
ru: 9 — отлично

# Onboarding.8
source: 8 — is good
ru: 8 — хорошо

# Onboarding.7
source: 7 — is not bad
ru: 7 — неплохо

# Onboarding.6
source: 6 - above average
ru: 6 — выше среднего

# Onboarding.5
source: 5 - medium
ru: 5 — средне

# Onboarding.4
source: 4 - below average
ru: 4 — ниже среднего

# Onboarding.3
source: 3 - so-so
ru: 3 — так себе

# Onboarding.2
source: 2 - bad
ru: 2 — плохо

# Onboarding.1
source: 1 - terrible
ru: 1 — ужасно

# Onboarding.0
source: 0 - I don't have this
ru: 0 — у меня нет этого

# Onboarding.Tutorial.PrimaryText
source: Click
ru: Нажми

# Onboarding.Tutorial.SecondaryText
source: to select a value
ru: чтобы выбрать значение

# Onboarding.DeleteAnonymousAccount.Success
source: Anonymous account has been deleted. See you soon!
ru: Анонимный аккаунт удалён. До новых встреч!

# Onboarding.User.Error
source: Could not identify user
ru: Не удалось определить пользователя

# Post.title
source: Add Event
ru: Добавить событие

# Post.emptySphere
source: Select a sphere
ru: Выбери сферу

# Post.chooseSphere
source: Choose a sphere
ru: Выбери сферу

# Post.titleDefault
source: Event
ru: Событие

# Post.successValue
source: +0.1 points
ru: +0,1 балла

# Post.notAddValue
source: no changes
ru: без изменений

# Post.emptyText
source: The text field is empty
ru: Поле текста пустое

# Post.placeholder
source: For example, morning exercises, a chapter of a book has been read, a new acquaintance...
ru: Например, утренняя зарядка, прочитана глава книги, новое знакомство...

# Post.edit.success
source: Post edited
ru: Пост отредактирован

# Post.edit.title
source: Edit
ru: Редактировать

# Welcome.title
source: What is GetBetter?
ru: Что такое GetBetter?

# Welcome.description
source: This is an application that will help you determine which areas of life you need to pump in order to achieve harmony. First, let's determine your current level. Scroll right ➡️➡️➡️ Do not rush to answer, be honest with yourself.
ru: Это приложение, которое поможет тебе определить, какие сферы жизни нужно прокачать, чтобы добиться гармонии. Для начала давай определим твой текущий уровень. Листай вправо ➡️➡️➡️ Не торопись отвечать, будь честен с собой.

# AboutApp.title
source: About App
ru: О приложении

# AboutApp.description
source: <p style = "font-family: -apple-system, BlinkMacSystemFont, sans-serif; font-size: 14px;"><b><span style = "color: #7d4df1">GetBetter</span></b> is an application that helps you determine if <b><span style = "color: #7d4df1"> what spheres should be pumped to achieve harmony.</span></b></p> <p></p> <p style = "font-family: -apple-system, BlinkMacSystemFont, sans-serif; font-size: 14px; "> <b>Idea and development</b><br> <a href="https://www.notion.so/Artur-Islamgulov-72c202cd6d954fce9dc0f00cba8270d6"> Artur Islamgulov </a> <br> <br> <b> Here's how this app is made </b> <br> <a href="https://t.me/getbetterapp">GetBetter on Telegram</a> <br> <br> <b> Visual style </b> <br> <a href="https://alekseybusygin.com">Alexey Busygin</a> </p>
ru: <p style="font-family: -apple-system, BlinkMacSystemFont, sans-serif; font-size:14px;"> <b><span style="color:#7d4df1">GetBetter</span></b> — это приложение, которое помогает тебе определить, <b><span style="color:#7d4df1">какие сферы следует прокачать, чтобы добиться гармонии.</span></b></p> <p></p> <p style="font-family: -apple-system, BlinkMacSystemFont, sans-serif; font-size:14px;"> <b>Идея и разработка</b><br> <a href="https://www.notion.so/Artur-Islamgulov-72c202cd6d954fce9dc0f00cba8270d6">Артур Исламгулов</a><br><br> <b>Рассказываю, как делается это приложение</b><br> <a href="https://t.me/getbetterapp">GetBetter в Telegram</a><br><br> <b>Визуальный стиль</b><br> <a href="https://alekseybusygin.com">Алексей Бусыгин</a></p>

# AboutCircle.title
source: Wheel of Life
ru: Колесо жизненного баланса

# AboutCircle.tableTitle
source: Wheel of Life
ru: Колесо жизненного баланса

# AboutCircle.description
source: <p style = " font-family: -apple-system, BlinkMacSystemFont, sans-serif; font-size: 14px; ">This graph shows which areas of your life are already at a good level, and <b> <span style = "color: #7d4df1 "> which areas should be pumped. </span> </b> <br> To make the wheel round, you need to align the values ​​- reduce the importance of one or do something in other areas. <b> <span style = "color: #7d4df1"> Keep notes in the journal section regularly. </span> </b> This way you will clearly see the results.
ru: <p style="font-family: -apple-system, BlinkMacSystemFont, sans-serif; font-size:14px;"> Этот график показывает, какие сферы твоей жизни уже находятся на хорошем уровне, а <b><span style="color:#7d4df1">какие сферы следует прокачать.</span></b><br> Чтобы колесо стало круглым, нужно выровнить значения — уменьшить важность одного или сделать что-то в других сферах. <b><span style="color:#7d4df1">Регулярно веди записи в разделе Дневник.</span></b> Так ты наглядно увидишь результаты.

# AboutJournal.title
source: Game Rules
ru: Правила игры

# AboutJournal.tableTitle
source: Game Rules
ru: Правила игры

# AboutJournal.description
source: <p style = " font-family: -apple-system, BlinkMacSystemFont, sans-serif; font-size: 14px; ">Every time you add an event to your journal, you will receive for it <b> <span style = "color: #7d4df1 "> plus 0.1 point to the current level </span> </b>. For example, I did exercises - plus 0.1 to health. Closed an important deal - plus 0.1 to work. And so on. <br> Every day, with due effort, the wheel will straighten its edges more and more. <b> <span style = "color: #7d4df1 "> This is the meaning of GetBetter. </span> </b> <br> Do not forget to regularly multiply bright events and do not throw in areas that require attention.
ru: <p style="font-family: -apple-system, BlinkMacSystemFont, sans-serif; font-size:14px;"> Каждый раз, когда ты добавляешь событие в дневник, ты получаешь за него <b><span style="color:#7d4df1">плюс 0,1 балла к текущему уровню</span></b>. Например, сделал зарядку — плюс 0,1 к здоровью. Закрыл важную сделку — плюс 0,1 к работе. И так далее.<br> С каждым днём при должных усилиях колесо будет всё больше выпрямлять свои грани. <b><span style="color:#7d4df1">В этом и смысл GetBetter.</span></b><br> Не забывай регулярно множить яркие события и не забрасывать сферы, которые требуют внимания.

# Settings.title
source: Settings
ru: Настройки

# Settings.exit
source: Exit
ru: Выйти

# Settings.defaultName
source: Anonymous user
ru: Анонимный пользователь

# Settings.defaultEmail
source: Email not specified
ru: E-mail не указан

# Settings.versionIs
source: Version %@
ru: Версия %@

# Settings.logout.alert.question
source: Sign out of GetBetter?
ru: Выйти из GetBetter?

# Settings.logout.alert.yes
source: Sign Out
ru: Выйти

# Settings.logout.alert.no
source: No
ru: Нет

# Settings.Push.Title
source: Push Notifications
ru: Push-уведомления

# Settings.Push.Saved
source: Notification settings saved
ru: Настройки уведомлений сохранены

# Settings.Push.None
source: Don't come
ru: Не приходят

# Settings.DiffLevel.Easy
source: Low
ru: Низкий

# Settings.DiffLevel.Medium
source: Normal
ru: Нормальный

# Settings.DiffLevel.Hard
source: High
ru: Высокий

# Settings.DiffLevel.Title
source: Difficulty level
ru: Уровень сложности

# Settings.DiffLevel.Save
source: Difficulty level set
ru: Уровень сложности установлен

# Settings.DiffLevel.Info.Title
source: Difficulty level
ru: Уровень сложности

# Settings.DiffLevel.Info.Description
source: At low difficulty you will gain points faster than at high difficulty. Hardcore is a real challenge to yourself.
ru: На низком уровне сложности ты будешь набирать баллы быстрее, чем на высоком. Hardcore уровень — настоящий вызов самому себе.

# Settings.Logout.Alert.No.Email
source: No e-mail specified. You will no longer be able to log into GetBetter with this profile. Data will be lost 😔
ru: Не указан e-mail. Ты больше не сможешь войти в GetBetter под этим профилем. Данные будут утеряны 😔

# Settings.aboutApp.postReview
source: Leave a review in the AppStore
ru: Оставить отзыв в AppStore

# PushNotifications.title
source: Notifications
ru: Уведомления

# PushNotifications.Header.Tip
source: Tip of the Day
ru: Cовет дня

# PushNotifications.Header.Post
source: Day summary
ru: Итоги дня

# PushNotifications.save
source: Save
ru: Сохранить

# PushNotifications.description
source: Here you can configure the time for sending push notifications. Choose a suitable time and click Save. The time is indicated in Moscow. Pushes come every day.
ru: Здесь можно настроить время отправки push-уведомлений. Выбери подходящее время и нажми Сохранить. Время указано московское. Пуши приходят каждый день.

# EditProfile.successPassChanged
source: Password changed successfully
ru: Пароль успешно изменён

# EditProfile.delete.alert.title
source: Are you sure you want to delete this account?
ru: Удалить аккаунт?

# EditProfile.delete.alert.message
source: You may need to enter your password
ru: Возможно, потребуется ввести пароль

# EditProfile.delete.alert.yes
source: Yes, delete
ru: Да, удалить

# EditProfile.delete.alert.no
source: No
ru: Нет

# EditProfile.delete.alert.success
source: Account deleted successfully. Until next time!
ru: Аккаунт успешно удалён. До новых встреч!

# EditProfile.delete.button
source: Delete Account
ru: Удалить аккаунт

# EditProfile.save
source: Save
ru: Сохранить

# EditProfile.reauth.alert.title
source: Please enter your account password
ru: Введите пароль от аккаунта

# EditProfile.reauth.alert.ok
source: Remove Account
ru: Удалить аккаунт

# EditProfile.reauth.error
source: The password may be incorrect. Please try again
ru: Возможно, пароль неверный. Попробуйте снова

# AddPost.title
source: Add Post
ru: Добавить запись

# AddPost.save
source: Save
ru: Сохранить

# AddPost.maxSymbolAlert
source: No more than %@ characters
ru: Не более %@ символов

# AddPost.notAddSphereValue
source: Do not add points
ru: Не прибавлять баллы

# Tip.title.1
source: Early rise
ru: Ранний подъем

# Tip.text.1
source: All successful people are early risers. There is something special and magical about the early ascent. This part of the day, when the world has not yet woken up, is the most important and inspiring. Those who get up before the sun rises claim that their life has become full. Try to get up early, and in a month or two you will remember with pity those years when the dawn was met in bed.
ru: Все успешные люди - пташки ранние. Что-то особенное и магическое есть в раннем подъеме. Эта часть дня, когда еще мир не проснулся, - самая важная и вдохновляющая. Те, кто встает до рассвета солнца, утверждают, что их жизнь стала полноценной. Попробуйте и вы вставать рано, и уже через месяц-другой вы будете с жалостью вспоминать те года, когда рассвет встречали в постели.

# Tip.title.2
source: Enthusiastic reading
ru: Увлеченное чтение

# Tip.text.2
source: If you replace an hour of sitting in front of the TV or computer with reading a useful and interesting book, you will become the smartest person among your surroundings. You will find answers to questions faster, it will be more interesting to communicate with you, and a lot of things will turn out by themselves. As Mark Twain said: "A person who does not read good books has no advantage over a person who does not know how to read".
ru: Если в день заменить час сидения перед телевизором или компьютером на чтение полезной и интересной книги, то вы станете самым умным человеком среди своего окружения. Вы будете быстрее находить ответы на вопросы, с вами будет интереснее общаться, многое будет получаться само собой. Как сказал Марк Твен: "Человек, который не читает хороших книг, не имеет преимуществ перед человеком, который не умеет читать".

# Tip.title.3
source: Ability to simplify
ru: Умение упрощать

# Tip.text.3
source: Simplification is the elimination of the unnecessary and useless. It is necessary to be able to simplify everything that can and should be simplified. Although it requires a long practice, in the end it gives a positive result. The memory and feelings are cleared, you are less worried and nervous. The simpler your life is, the more you can enjoy it.
ru: Упрощение - это устранение ненужного и бесполезного. Необходимо уметь упрощать все, что можно и нужно упростить. Хоть это и требует долгой практики, в итоге дает положительный результат. Очищаются память и чувства, вы меньше переживаете и нервничаете. Чем будет проще ваша жизнь, тем больше вы сможете ею наслаждаться.

# Tip.title.4
source: Slow down
ru: Замедление

# Tip.text.4
source: It is impossible to enjoy life in constant stress and chaos. Find a quiet time for yourself, stop, listen to yourself and your inner voice. Pay attention to everything that matters to you. Make it a habit to wake up early, when there is silence around, to meditate, to reflect, to create. Slow down the pace of life, and then everything you were chasing will catch up with you.
ru: Наслаждаться жизнью в постоянном стрессе и хаосе невозможно. Найдите для себя тихое время, остановитесь, прислушайтесь к себе и своему внутреннему голосу. Обратите внимание на все, что имеет для вас значение. Возьмите за привычку просыпаться рано, когда вокруг тишина, чтобы медитировать, размышлять, созидать. Замедлите темп жизни, и тогда все, за чем вы гнались, само догонит вас.

# Tip.title.5
source: Train
ru: Тренируйтесь

# Tip.text.5
source: Regular activity keeps you healthy. If you don't have time to exercise right now, sooner or later you'll start doing it anyway to maintain your health. You can do sports not only in gyms, but also at home.
ru: Регулярная активность сохраняет здоровье. Если у вас сейчас нет времени на тренировки, рано или поздно вы все равно начнете их делать, чтобы поддерживать свое здоровье. Спортом можно заниматься не только в тренажёрных залах, но и дома.

# Tip.title.6
source: Daily practice
ru: Ежедневная практика
