Repository: stoletnaedine/get-better-ios
Catalog: Classes/Resources/*.lproj/Localizable.strings
Languages: ru

# Tip.text.75
source: If you don't control the news that reaches you, then they control you.
ru: Если вы не управляете новостями, которые доходят до вас, значит, они управляют вами.

# Tip.title.76
source: Choose your colleagues to your liking
ru: Выбирайте коллег по душе

# Tip.text.76
source: Work only with those people with whom you would like to have tea or coffee after work.
ru: Работайте только с теми людьми, с кем вы хотели бы после работы выпить чай или кофе.

# Tip.title.77
source: Don't keep gadgets in the bedroom
ru: Не держите гаджеты в спальне

# Tip.text.77
source: Then you will just be too lazy to follow him, and you will rest (which is what you need to do in the bedroom).
ru: Тогда вам будет просто лень за ним идти, и вы будете отдыхать (чем и нужно заниматься в спальне).

# Tip.title.78
source: Write down things for the future
ru: Записывайте дела на будущее

# Tip.text.78
source: If you remember that you need to do something, write it down in your phone's Reminders. And when you have time to do that, do this list.
ru: Если вы вспомнили, что нужно что-то сделать, запишите это в Напоминания телефона. И когда на это будет время, займитесь этим списком.

# Tip.title.79
source: Give yourself a "social" detox
ru: Устраивайте себе «социальный» детокс

# Tip.text.79
source: This reduces the impact of meaningless social white noise in the head.
ru: Это снижает влияние бессмысленного «социального белого шума» в голове.

# Tip.title.80
source: Remember that your social media profiles are your online portrait
ru: Помните, что ваши профили в соцсетях — это ваш интернет-портрет

# Tip.text.80
source: Keep track of what and how you post.
ru: Следите за тем, что и как вы публикуете.

# Tip.title.81
source: Try working standing up
ru: Попробуйте работать стоя

# Tip.text.81
source: This is good for the body, but standing for a long time is not very comfortable, so you will work more efficiently and productively so that you can move away from the table and take a little rest.
ru: Это полезно для тела, но долго стоять не очень удобно, поэтому вы будете более эффективно и продуктивно работать, чтобы можно было отойти от стола и немного передохнуть.

# Tip.title.82
source: Teach others, tell the community what you know about
ru: Обучайте других, рассказывайте сообществу то, о чём знаете

# Tip.text.82
source: By teaching others, we learn ourselves. Speaking will help you overcome your fears, learn how to speak in front of an audience, and learn how to think quickly when answering questions.
ru: Обучая других, мы сами учимся. Выступление поможет преодолеть страхи, научиться умению говорить перед аудиторией, научиться быстро соображать, отвечая на вопросы.

# Tip.title.83
source: Cut off unnecessary things
ru: Отсекайте лишнее

# Tip.text.83
source: Delete unused programs, unnecessary profiles in social networks and projects, unnecessary contacts in your phone, unsubscribe from unnecessary services. Anything you don't use slows you down.
ru: Удаляйте неиспользуемые программы, ненужные профили в соцсетях и проектах, ненужные контакты в телефоне, отписывайтесь от ненужных сервисов. Всё, что вы не используете, тормозит вас.

# Tip.title.84
source: Keep the workplace in order
ru: Держите рабочее место в порядке

# Tip.text.84
source: Order in the head begins with order in the surrounding space.
ru: Порядок в голове начинается с порядка в окружающем пространстве.

# Tip.title.85
source: Don't forget to rest
ru: Не забывайте отдыхать

# Tip.text.85
source: If you do not allocate a strictly defined time for work, there is a risk of turning your life into a permanent job.
ru: Если не выделять для работы строго определённое время, есть риск превратить свою жизнь в постоянную работу.

# Tip.title.86
source: Learn new things
ru: Учитесь новому

# Tip.text.86
source: This will allow you to look at your tasks more broadly and find non-standard solutions.
ru: Это позволит смотреть на свои задачи шире и находить нестандартные решения.

# Tip.title.87
source: Don't be indifferent and cynical
ru: Не будьте равнодушным и циничным

# Tip.text.87
source: This is good for TV series characters, but real life is more multidimensional than any TV series.
ru: Это хорошо для героев сериалов, но реальная жизнь многомернее любого сериала.

# AppVersions.title
source: Version History
ru: История версий

# AppVersions
source: 🌚 2.0: • Redesign of my Tips of the Day list • Downloaded data is saved on the device and available without a network • 2000 characters per post • Selecting photos via camera or gallery • Filters for photos • You can upload multiple photos in one post • Gallery to view photos in a post • Added the ability not to add points for the post • Search by text, sphere, date in the Journal • English in the app • Numerous improvements and fixes 🤟 1.14.1: • Announcement of version 2.0 🔨 1.14: • If you go to the post and edit it, then the post is immediately updated • Increased the button for selecting a photo in a post • The rules of the game have been moved to the Wheel of Balance and Journal sections • Fixed a bug with deleting an account (thanks to Mary for finding a bug) • New loading animation • Code refactoring 🏞 1.13: • Large preview of the image in the post • When editing a post, you can now add or change a picture • Added swipe-actions in the Journal: you can edit or delete the post • Fix bug counting characters when editing a post 🧐 1.12.1: • Fix bug with Firebase / Analytics 🏟 1.12: • Added difficulty level (for those who write actively or rarely write) • Setting the time of pushing has become more convenient • Added the number of posts by month • Minor improvements 🐪 1.11: • Updated the application icon: after all, New Year, Christmas and International Fasting Day • Added time setting for push notifications • The text of the post is saved in the draft if the post was not sent • Added new Tips of the Day • Added achievement Round number • A clever algorithm for reducing the wheel of life slightly reduced its ardor 👻 1.10.1: • Added animation japan • Corrected cell colors • Fix crash when adding a post after pushing 📬 1.10: • Added push notifications for tips of the day. Added an indication of the time of sending. • When tapping on push notifications, screens open to add a post or advice of the day • Improved text logic in spheres detailing • Large print inside the post if there is little text • Added animations to Journal and My Tips of the Day if there is no content • Fix registration bugs 🗿 1.9: • Added detailing of spheres. You can find it like this: Wheel -> Metrics -> click on the Sphere • Russian localization in the project settings • For those who have not found the easter egg - try clicking on the GetBetter logo in the section "About the application" 🎉 1.8.2: • Updated loading animation 🎉 1.8.1: • Added Easter egg • Updated third party libraries 💜 1.8: • Tips of the day can now be liked, they are counted for all users • Added a section with the tips of the day you liked • Tip of the day can be shared on social networks and messengers or saved to the gallery • Optimization of memory usage 🎐 1.7: • Added new tips of the day (principles). Moved the tips of the day to the app • Added new backgrounds for tips of the day • Replaced the sphere selection icon in the post with a neat one (Alexey, now everything is ok) • Checking for network availability on requests (fixed critical bugs) 🤳 1.6: • Made achievements in a separate section • Added a button to the tabbar to add a post • Updated icons for adding a photo and closing the pop-up window • Buttons current / start wheel now toggle without bugs • Corrected texts 🎓 1.5: • Corrected the display of pictures in the tutorials in the settings • In the absence of the Internet, alerts about a connection error are now displayed • Changed the display of the profile in the settings • The photo in the post is now displayed on top and across the entire width (thanks to Lesha for the hint) • Minor improvements 🐸 1.4: • In posts, you can now edit the text • Added new cool backgrounds for tips of the day • Tip of the day opens in full screen, you can close it with a swipe down • Corrected colors in metrics 🧶 1.3: • Added tip of the day for inspiration • Notification subscription settings are now stored in the cloud instead of on the device 🍭 1.2: • Added an algorithm for the natural decrease in the level of the wheel of life over time • Profile photo is now centered • Scroll for FAQ in settings • In unopened achievements for 3, 5, 7, 10 days, now only the last number of days of Journal keeping in a row is shown • Added statistics to the metrics: number of posts, days in the application, average score • Corrected the layout in editing the profile: all items now fit on SE 🗽 1.1.3: • Added push notifications. Now GetBetter can remind you to write down the results of the day in order to level up the spheres. You can enable notifications in the application settings • Corrected the layout of buttons in the wheel of life 🧴 1.1.1: • By clicking on the wheel of life, you can now see the values ​​in the spheres • Added statistics in metrics • Replaced the icon for attaching a photo when writing a post 🧲 1.1.0: • Added switching of the current and initial wheel of life • CancelButton moved to components 🤸 1.0.6: • The logic of the calculation of the current level in the spheres was brought to the client (and became faster) • Fixed color segmented control on the "Wheel of Life" screen for iOS 12 • Added caching of all pictures in the application • Added animation when uploading photos 🍄 1.0.5: • When you exit onboarding, the anonymous account is deleted • Added activity indicator to login without registration • Added placeholder when adding a post • Added a hint if the Journal is empty • Added alert when exiting the application • Highlighted phrases in articles. Put links in the section Our team • Labels are replaced with buttons wherever needed • Increased the area of ​​pressing the value selection button in onboarding 🎍 1.0.1: • Added training for the first launch of the application. • Minor improvements. 💆‍♂️ 1.0.0: • A visual pie chart showing progress in areas of life (work, health, creativity, and so on) • Journal of the main events of your life with photos • Data is stored in the cloud and accessible from any iOS device
ru: TODO • Новые Советы Дня • Английский язык в приложении • Возможность написать об ошибке на email • Редизайн раздела Колесо Жизни • График изменения Колеса Жизни 🌚 2.0: • Редизайн списка моих Советов Дня • Загруженные данные сохраняются на устройстве и доступны без сети • 2000 символов в посте • Выбор фото через камеру или галерею • Фильтры для фото • Можно загрузить несколько фото в один пост • Галерея для просмотра фото в посте • Добавлена возможность не прибавлять баллы за пост • Поиск в Дневнике • Многочисленные улучшения и исправления 🤟 1.14.1: • Анонс версии 2.0 🔨 1.14: • Если зайти в пост и отредактировать его, то пост сразу обновляется • Увеличена кнопка выбора фото в посте • Правила игры переехали в разделы Колесо Баланса и Дневник • Фикс бага с удалением аккаунта (спасибо Mary за найденную ошибку) • Новая анимация загрузки • Рефакторинг кода 🏞 1.13: • Большое превью картинки в посте • При редактировании поста теперь можно добавить или изменить картинку • Добавлены свайп-экшны в Дневнике: можно редактировать или удалить пост • Фикс бага подсчета символов при редактировании поста 🧐 1.12.1: • Фикс бага с Firebase/Analytics 🏟 1.12: • Добавлен уровень сложности (для тех, кто активно пишет или же пишет редко) • Настройка времени пушей стала удобнее • Добавлено количество постов по месяцам • Небольшие улучшения 🐪 1.11: • Обновили иконку приложения: всё-таки Новый год, Рождество и Международный разгрузочный день • Добавлена настройка времени push-уведомлений • Текст поста сохраняется в черновик, если пост не был отправлен • Добавлены новые Советы дня • Добавлена ачивка Круглая цифра • Хитрый алгоритм уменьшения колеса жизни немного убавил свой пыл 👻 1.10.1: • Добавлена анимация japan • Поправлены цвета ячеек • Фикс краша при добавлении поста после пуша 📬 1.10: • Появились пуши для советов дня. Добавлено указание времени отправки. • При тапе на пуши открываются экраны добавить пост или совет дня • Улучшена логика текстов в детализации сфер • Крупный шрифт внутри поста, если там мало текста • Добавлены анимации в Дневнике и Моих Советах Дня, если нет контента • Фикс багов регистрации 🗿 1.9: • Добавилась детализация сфер. Найти можно так: Колесо -> Метрики -> нажать на Сферу • Русская локализация в настройках проекта • Для тех, кто так и не нашел пасхалку — попробуйте нажать на логотип GetBetter в разделе "О приложении" 🎉 1.8.2: • Обновил анимации загрузки 🎉 1.8.1: • Добавил пасхалку • Обновил сторонние библиотеки 💜 1.8: • В советах дня теперь можно ставить лайки, они считаются по всем пользователям • Добавил раздел с понравившимися советами дня • Советом дня можно поделиться в соцсетях и мессенджерах или сохранить в галерею • Оптимизация использования памяти 🎐 1.7: • Добавил новые советы дня (принципы). Перенес советы дня в приложение • Добавил новые фоны для советов дня • Заменил иконку выбора сферы в посте на аккуратную (Лёша, теперь все ок) • Проверка на наличие сети при запросах (пофиксил критические баги) 🤳 1.6: • Вынес достижения в отдельный раздел • Добавил в таббар кнопку для добавления поста • Обновил иконки добавления фото и закрытия всплывающего окна • Кнопки текущее/начальное колесо теперь переключаются без багов • Поправил тексты 🎓 1.5: • Поправил отображение картинок в обучалках в настройках • При отсутствии интернета теперь отображаются алерты об ошибке подключения • Изменил отображение профиля в настройках • Фото в посте теперь отображается сверху и по всей ширине (спасибо Лёше за подсказку) • Небольшие улучшения 🐸 1.4: • В постах теперь можно редактировать текст • Добавил новые крутые фоны для советов дня • Совет дня открывается на весь экран, его можно закрыть свайпом вниз • Поправил цвета в метриках 🧶 1.3: • Добавил совет дня для вдохновения • Настройки подписки на уведомления теперь хранятся в облаке, а не на устройстве 🍭 1.2: • Добавил алгоритм естественного уменьшения уровня колеса жизни со временем • Фото в профиле теперь по центру • Скролл для FAQ в настройках • В не открытых достижениях про 3, 5, 7, 10 дней теперь показывается только последнее количество дней ведения дневника подряд • Добавил статистику в метрики: количество постов, дней в приложении, средний балл • Поправил верстку в редактировании профиля: на SE теперь влезают все пункты 🗽 1.1.3: • Добавил push-уведомления. Теперь GetBetter может напоминать вам записывать итоги дня, чтобы прокачивать сферы. Включить уведомления можно в настройках приложения • Поправил верстку кнопок в колесе жизни 🧴 1.1.1: • По нажатию на колесо жизни теперь можно увидеть значения в сферах • Добавил статистику в метриках • Заменил иконку прикрепления фотографии при написании поста 🧲 1.1.0: • Добавлено переключение текущего и начального колеса жизни • CancelButton вынесен в компоненты 🤸 1.0.6: • Логика просчета текущего уровня в сферах вынесена на клиент (и стала быстрее) • Поправлен цвет segmented control на экране "Колесо жизни" для iOS 12 • Добавлено кеширование всех картинок в приложении • Добавлена анимация при загрузке фото 🍄 1.0.5: • При выходе из онбординга анонимный аккаунт удаляется • Добавлен activity indicator на вход без регистрации • Добавлен placeholder при добавлении поста • Добавлена подсказка, если дневник пуст • Добавлен alert при выходе из приложения • Выделил цветом фразы в статьях. Проставил ссылки в разделе Наша команда • Labels заменены на buttons везде, где это нужно • Увеличена зона нажатия на кнопку выбора значения в онбординге 🎍 1.0.1: • Добавлено обучение при первом запуске приложения. • Небольшие улучшения. 💆‍♂️ 1.0.0: • наглядная круговая диаграмма, показывающая прогресс в сферах жизни (работа, здоровье, творчество и так далее) • дневник главных событий твоей жизни с фотографиями • данные хранятся в облаке и доступны с любого iOS-устройства
