Repository: stoletnaedine/get-better-ios
Catalog: Classes/Resources/*.lproj/Localizable.strings
Languages: ru

# Tip.text.6
source: The more a person practices, the luckier they become. After all, luck is where practice meets opportunity. Without practice, it is impossible to express your talent. By practicing, you will always be ready to take the opportunity to show your talent.
ru: Чем больше человек практикуется, тем удачливее он становится. Ведь удача - это то место, где практика встречается с возможностями. Без практики невозможно выразить свой талант. Практикуясь, вы всегда будете готовы воспользоваться возможностью показать свой талант.

# Tip.title.7
source: Environment
ru: Окружение

# Tip.text.7
source: It is this habit that can accelerate your success. Surround yourself with positive, energetic people. They are the best support, motivation and useful advice. In the hours of depression, communicating with your friends can lift you up.
ru: Именно эта привычка способна ускорить ваш успех. Окружите себя позитивными, энергичными людьми. Они - самая лучшая поддержка, мотивация и полезные советы. В часы депрессии общение со своими друзьями способно поднять вас на ноги.

# Tip.title.8
source: Start a gratitude journal
ru: Заведите журнал благодарностей

# Tip.text.8
source: This is a habit that can work wonders. Give thanks for everything you have and strive for the best. Gratitude contributes to the emergence of new reasons for joy. Before going to bed, write down one thing at a time that you are grateful for. Miracles will not keep you waiting!
ru: Это привычка, способная творить чудеса. Поблагодарите за все, что у вас есть, и стремитесь к лучшему. Благодарность способствует появлению новых поводов для радости. Перед сном записывайте по одной вещи, за которую вы благодарны. Чудеса не заставят себя ждать!

# Tip.title.9
source: Be persistent
ru: Будьте упорны

# Tip.text.9
source: Edison made 10,000 failed attempts before inventing the electric light bulb. Walt Disney, for the foundation of Disneyland, had to listen to 303 refusals from various banks before he achieved what he wanted. 134 publishers rejected the book by J. R. R. Tolkien. Canfield and Mark W. Hansen's "Chicken Soup for the Soul" before it became a worldwide bestseller. Do you feel a pattern? If you want to achieve what you want, be persistent and do not give up!
ru: Эдисон сделал 10000 неудачных попыток, прежде чем изобрести электрическую лампочку. Уолту Диснею для основания Диснейленда пришлось выслушать 303 отказа от различных банков, прежде чем он добился желаемого. 134 издателя отклонили книгу Дж. Кэнфилда и Марка В. Хансена “Куриный бульон для души”, прежде чем она стала мировым бестселлером. Чувствуете закономерность? Если вы хотите добиться желаемого, будьте упорны и не сдавайтесь!

# Tip.title.10
source: Let go of people and situations
ru: Отпускайте людей и ситуации

# Tip.text.10
source: Do not scroll through possible event options. It happened as it happened. When it's hard to let go, ask two questions: — Will this be important to me in 5 years? — I'm flying to Singapore tonight (any place you really want to visit), will I take this problem with me?
ru: Не прокручивайте возможные варианты событий. Случилось так, как случилось. Когда сложно отпустить, задавайте два вопроса: — Будет ли это важно для меня через 5 лет? — Сегодня вечером я вылетаю в Сингапур (любое место, которое очень хотите посетить), возьму ли я эту проблему с собой?

# Tip.title.11
source: At the end of each week, answer the following questions:
ru: В конце каждой недели отвечайте на вопросы:

# Tip.text.11
source: What did I learn last week? The biggest achievement of the week? What was the most memorable moment this week and why? Did I waste my time on something? If so, for what?
ru: «Что я изучил на прошлой неделе?» «Самое большое достижение за неделю?» «Какой момент на этой неделе был самым незабываемым и почему?» «Потратил ли я на что-то время впустую? Если да, то на что?»

# Tip.title.12
source: Watch your appearance
ru: Следите за внешностью

# Tip.text.12
source: Always be ready for new achievements and unexpected encounters. "Hello! I can't believe it… I've been dreaming about meeting you all my life! Eeeee... But I'm sorry, I don't look very good today... I'm too tired, you know..."
ru: Всегда будьте готовы к новым достижениям и неожиданным встречам. «Здравствуйте! В голове не укладывается… Мечтал о встрече с Вами всю жизнь! Ээээ… Только вы извините, сегодня я не очень хорошо выгляжу… Замотался, знаете ли…»

# Tip.title.13
source: Do not whine and do not complain about fate
ru: Не нойте и не жалуйтесь на судьбу

# Tip.text.13
source: Silently get up, go and do whatever is necessary.
ru: Молча встаньте, идите и делайте всё, что необходимо.

# Tip.title.14
source: Travel
ru: Путешествуйте

# Tip.text.14
source: Twice a year, go somewhere you've never been before. Travel will help you find yourself.
ru: Два раза в год отправляйтесь туда, где никогда не были. Путешествия помогут обрести себя.

# Tip.title.15
source: Allow yourself to make mistakes
ru: Позвольте себе делать ошибки

# Tip.text.15
source: Missed something – don't miss the lesson from this. A bug is a great opportunity for development.
ru: Что-то упустили – не упустите урок из этого. Ошибка – отличная возможность для развития.

# Tip.title.16
source: Develop your personality
ru: Развивайте индивидуальность

# Tip.text.16
source: You are what you are. Don't compete with anyone but yourself.
ru: Вы такие, какие есть. Ни с кем не соревнуетесь, кроме себя.

# Tip.title.17
source: Make your own decisions
ru: Принимайте решения самостоятельно

# Tip.text.17
source: Do not cook according to someone else's recipes.
ru: Не готовьте по чужим рецептам.

# Tip.title.18
source: Do not impose yourself
ru: Не навязывайтесь

# Tip.text.18
source: The world is huge – there is definitely someone in it who will be happy, getting exactly your look and smile.
ru: Мир огромен – в нём точно есть тот, кто будет счастлив, получая именно Ваши взгляд и улыбку.

# Tip.title.19
source: Meditate every day
ru: Медитируйте каждый день

# Tip.text.19
source: Learn to relax and concentrate.
ru: Учитесь расслабляться и концентрироваться.

# Tip.title.20
source: Smile if something didn't go as planned
ru: Улыбайтесь, если что-то вышло не так, как вы планировали

# Tip.text.20
source: Remember, not getting what you want is sometimes lucky.
ru: Помните, не получить желаемое – иногда и есть везение.

# Tip.title.21
source: Learn to say NO
ru: Учись говорить «НЕТ»

# Tip.text.21
source: Don't be afraid to refuse! -Would you like to make a courtesy call? -No!
ru: Не бойтесь отказывать! — Не желаете ли совершить визит вежливости? — Нет!

# Tip.title.22
source: Rate your words
ru: Оценивайте свои слова

# Tip.text.22
source: Evaluate each spoken word for truthfulness, usefulness, and kindness. Speak only in essence, nothing superfluous. No more gossip, lies, and complaints! It is better to be silent if there is nothing to say.
ru: Оценивайте каждое произносимое слово на правдивость, полезность и доброту. Говорите только по сути, ничего лишнего. Нет сплетням, лжи и жалобам! Лучше молчите, если нечего сказать.

# Tip.title.23
source: Think
ru: Думайте

# Tip.text.23
source: Before making a decision, estimate its cost.
ru: Прежде, чем принять решение, оцените его стоимость.

# Tip.title.24
source: 24 hours
ru: 24 часа

# Tip.text.24
source: If you happen to be very angry with someone, wait 24 hours before replying.
ru: Если Вас угораздило сильно разозлиться на кого-то – подождите 24 часа прежде, чем ответить.

# Tip.title.25
source: Be independent and self-sufficient
ru: Будьте независимы и самодостаточны

# Tip.text.25
source: Your happiness depends only on you, not on how other people think and act.
ru: Ваше счастье зависит только от Вас, а не от того, как думают и поступают другие люди.

# Tip.title.26
source: Respect yourself and others
ru: Уважайте себя и других

# Tip.text.26
source: The person chooses for himself. Do not interfere in matters that do not concern you. Do not look into someone else's life with thoughts and words – do not lose sight of your choice!
ru: Человек выбирает сам. Не вмешивайтесь в дела, которые Вас не касаются. Не заглядывайте в чужую жизнь мыслями и словами – не упускайте из вида cвой выбор!

# Tip.title.27
source: Act exclusively within your own sphere of influence
ru: Действуйте исключительно внутри собственной сферы влияния

# Tip.text.27
source: Don't worry about what you can't influence.
ru: Не беспокойтесь о том, на что не можете влиять.

# Tip.title.28
source: Get out in the fresh air every day
ru: Бывайте на свежем воздухе каждый день

# Tip.text.28
source: Regardless of the weather and mood.
ru: Вне зависимости от погоды и настроения.

# Tip.title.29
source: Believe in dreams and ideas
ru: Верьте в мечты и идеи

# Tip.text.29
source: Time is nonlinear. They have already been realized!
ru: Время нелинейно. Они уже осуществились!

# Tip.title.30
source: Develop your talents
ru: Развивайте таланты

# Tip.text.30
source: Remember, you have them! Just open your eyes.
ru: Помните, они у Вас есть! Просто откройте глаза.

# Tip.title.31
source: Be responsible for your words and actions
ru: Будьте ответственны за свои слова и поступки

# Tip.text.31
source: Your words have great power.
ru: Ваши слова имеют огромную силу.

# Tip.title.32
source: Be faithful
ru: Будьте верным

# Tip.text.32
source: People, principles, and choices. "Being faithful is not an innate quality. This is the solution!"
ru: Людям, принципам и выбору. «Быть верным – не врождённое качество. Это решение!»

# Tip.title.33
source: Do it right away
ru: Делай сразу

# Tip.text.33
source: If there is a case that will take less than 3 minutes to complete – it should be completed immediately. Do not put it in a long box. Nothing fits there for a long time.
ru: Если есть дело, работа над которым займёт меньше 3-х минут, – его следует выполнить незамедлительно. Не откладывайте в доооолгий ящик. Туда давно уже ничего не помещается.

# Tip.title.34
source: Watch your health
ru: Следите за здоровьем

# Tip.text.34
source: It is one. You have achievements ahead of you – you will need your health to realize them. Sports, yoga, meditation will help. Check!
ru: Оно – одно. Впереди у Вас свершения – здоровье понадобится для их реализации. Спорт, йога, медитация помогут. Проверьте!

# Tip.title.35
source: Find inner peace and harmony
ru: Обретите внутренний покой и гармонию

# Tip.text.35
source: The true strength of a person is shown not in impulses, but in calmness.
ru: Истинная сила человека проявляется не в порывах, а в спокойствии.

# Tip.title.36
source: Accept the fact that the past is in the past
ru: Примите факт, что прошлое в прошлом

# Tip.text.36
source: It doesn't exist! Extract the experience, release it, and move on.
ru: Его не существует! Извлекайте опыт, отпустите и идите дальше.

# Tip.title.37
source: Prioritize
ru: Расставляйте приоритеты

# Tip.text.37
source: Everything has its place.
ru: Всему своё место.

# Tip.title.38
source: Conquer your fears
ru: Побеждайте страхи

# Tip.text.38
source: Fear is just an illusion.
ru: Страх – всего лишь иллюзия.

# Tip.title.39
source: Never give up!
ru: Никогда не сдавайтесь!

# Tip.text.39
source: Perseverance and perseverance are always rewarded.
ru: Настойчивость и упорство всегда вознаграждаются.

# Tip.title.40
source: The Mirror principle
ru: Принцип зеркала

# Tip.text.40
source: Before you judge another person, pay attention to yourself first. It's about a speck in someone else's eye. We're all not perfect.
ru: Перед тем, как осудить другого человека, обратите сначала внимание на себя. Это про соринку в чужом глазу. Все мы не идеальны.

# Tip.title.41
source: The Boomerang Principle
ru: Принцип бумеранга

# Tip.text.41
source: By helping others, you help yourself. Everything you've always done will come back to you, at the right time, in the right place, and from the right people.
ru: Помогая другим, вы помогаете себе. Все и всегда сделанное вами, вернется к вам обратно, в нужное время, в нужном месте и от нужных людей.

# Tip.title.42
source: The principle of pain
ru: Принцип боли

# Tip.text.42
source: You hurt others when you hurt yourself. And when the heart is filled with love, the desire to offend others disappears by itself.
ru: Вы наносите обиды другим, когда обижены сами. А когда сердце наполнено любовью, желание обижать других пропадает само собой.

# Tip.title.43
source: The principle of the hammer
ru: Принцип молотка

# Tip.text.43
source: Do not use a hammer to kill a small mosquito on the forehead of the interlocutor. Be tactful and don't say things you might regret later.
ru: Не надо использовать молоток, чтобы убить маленького комара на лбу собеседника. Будьте тактичны и не говорите того, о чем можете потом пожалеть.

# Tip.title.44
source: Upper road principle
ru: Принцип верхней дороги

# Tip.text.44
source: When we start treating other people better than they treat us, we move to a higher level of development. Rising higher and higher, do not stoop to gossip, criticism and condemnation.
ru: Когда мы начинаем обращаться с другими людьми лучше, чем они обращаются с нами, мы переходим на более высокий уровень развития. Поднимаясь все выше и выше, не опускайтесь до сплетен, критики и осуждения.

# Tip.title.45
source: The principle of charisma
ru: Принцип харизмы

# Tip.text.45
source: Be genuinely interested in people, because most often we show interest in the person who is interested in us.
ru: Искренне интересуйтесь людьми, ведь чаще всего мы проявляем интерес к тому человеку, который интересуется нами.

# Tip.title.46
source: The principle of exchange
ru: Принцип обмена

# Tip.text.46
source: Don't put people in their place, learn to put YOURSELF in their place. Then you will judge less often and understand more.
ru: Не ставьте людей на «их место», научитесь СЕБЯ ставить на их место. Тогда вы будете реже судить и больше понимать.

# Tip.title.47
source: The principle of 100 points
ru: Принцип 100 баллов

# Tip.text.47
source: When you see more positive than negative in a person and believe in their best qualities, you "force" them to show them.
ru: Когда вы видите в человеке больше положительного, чем отрицательного и верите в его лучшие качества, вы «заставляете» его проявлять их.

# Tip.title.48
source: The principle of learning
ru: Принцип обучения

# Tip.text.48
source: Every person in our life is our teacher, who has the potential to teach us something.
ru: Каждый человек в нашей жизни – это наш учитель, который потенциально способен нас чему-то научить.

# Tip.title.49
source: Stone rock principle
ru: Принцип каменной скалы

# Tip.text.49
source: The strong foundation of any relationship is trust. Try to trust people and not betray people who trust you.
ru: Крепкий фундамент любых взаимоотношений – это доверие. Старайтесь доверять людям и не предавать людей, которые доверяют вам.

# Tip.title.50
source: The principle of confrontation
ru: Принцип конфронтации

# Tip.text.50
source: Take care of the person before you confront them.
ru: Прежде чем вступить с человеком в конфронтацию, позаботьтесь о нем.

# Tip.title.51
source: Bob's principle
ru: Принцип Боба

# Tip.text.51
source: If Bob has problems with everyone, then the main problem, most often, is himself.
ru: Если у Боба проблемы со всеми, то главной проблемой, чаще всего, является он сам.

# Tip.title.52
source: Elevator principle
ru: Принцип лифта

# Tip.text.52
source: When we communicate with people, we either raise them up or lower them down. Always remember this and try to raise the person, not lower them.
ru: Общаясь с людьми, мы либо поднимаем их вверх, либо опускаем вниз. Всегда помните об этом и старайтесь поднять человека, а не опустить.

# Tip.title.53
source: Accessibility principle
ru: Принцип доступности

# Tip.text.53
source: When a person is at ease with himself, others also feel at ease and at ease with him. The relationship with yourself reflects the attitude of other people towards us.
ru: Когда человеку легко с самим собой, другие тоже чувствуют себя легко и свободно с ним. Отношения с самим собой отражает отношение к нам других людей.

# Tip.title.54
source: Trench principle
ru: Принцип окопа

# Tip.text.54
source: If you are preparing for a battle, dig a trench that will fit not only you, but also your friend.
ru: Если вы готовитесь к сражению, выкопайте такой окоп, в котором поместитесь не только вы, но и ваш друг.

# Tip.title.55
source: The 101 percent principle
ru: Принцип 101 процента

# Tip.text.55
source: Find the 1 percent you agree with and put 100 percent of your effort into it.
ru: Отыщите 1 процент, с которым вы согласны и направьте на него 100 процентов усилий.

# Tip.title.56
source: The principle of patience
ru: Принцип терпения

# Tip.text.56
source: Always remember that traveling with others is slower than traveling alone.
ru: Всегда помните, что путешествовать с другими приходится медленнее, чем одному.

# Tip.title.57
source: The principle of celebration
ru: Принцип празднования

# Tip.text.57
source: The real test of friendship is not how much we put our shoulder to our friends when they have problems, but how much we enjoy their success.
ru: Настоящая проверка дружбы заключается не в том, насколько мы подставляем свое плечо своим друзьям, когда у них проблемы, а в том, насколько мы радуемся их успехам.

# Tip.title.58
source: The principle of friendship
ru: Принцип дружбы

# Tip.text.58
source: All other things being equal, as well as unequal, people will always strive to work with those they like.
ru: Как при прочих равных условиях, так и при неравных, люди всегда будут стремиться работать с теми, кто им нравится.

# Tip.title.59
source: Satisfaction principle
ru: Принцип удовлетворения

# Tip.text.59
source: In a great relationship, both parties just need to be together to get joy and pleasure.
ru: В прекрасных взаимоотношениях обеим сторонам для получения радости и удовольствия достаточно просто находиться вместе.

# Tip.title.60
source: Become an explorer of your own life
ru: Cтань исследователем собственной жизни

# Tip.text.60
source: Try to always take the position of a researcher in everything. As long as you are conscious, no one and nothing can take away this opportunity from you.
ru: Постарайтесь всегда и во всем занимать позицию исследователя. Пока вы в сознании, никто и ничто не сможет отнять у вас эту возможность.

# Tip.title.61
source: It's not a shame to ask for support!
ru: О поддержке просить не стыдно!

# Tip.text.61
source: How important it is to be able not only to find support, but also to accept it. Decide to ask for help, and you will be surprised how much your life will change. Getting support makes us stronger!
ru: Как же важно уметь не только найти поддержку, но и принять ее. Решитесь попросить о помощи, и вы удивитесь, насколько ваша жизнь изменится. Получая поддержку, мы становимся сильнее!

# Tip.title.62
source: Be sincerely grateful
ru: Будьте благодарны искренне

# Tip.text.62
source: No one owes anyone anything. Everywhere is our own choice. With the resulting freedom and responsibility.
ru: Никто никому ничего не должен. Везде — наш собственный выбор. С проистекающей отсюда свободой и ответственностью.

# Tip.title.63
source: Dance today
ru: Потанцуйте сегодня

# Tip.text.63
source: No music. Without a reason. Without a partner. Or with a partner! Dancing will not take much time, but it will definitely decorate this day.
ru: Без музыки. Без повода. Без партнёра. Или с партнёром! Танцы не займут много времени, но точно украсят этот день.

# Tip.title.64
source: Don't give advice
ru: Не давайте советов

# Tip.text.64
source: Life is a collection of experiences, and the most important of them is to find new opportunities within yourself and overcome yourself. Share your advice only if asked.
ru: Жизнь — коллекция опытов, и самый главный из них — находить новые возможности внутри себя и преодолевать себя. Делитесь советом только, если об этом просят.

# Tip.title.65
source: Start moving towards the goal using what you have
ru: Начните двигаться к цели, используя то, что есть

# Tip.text.65
source: Distinguish false goals from true goals. You already have everything you need to start moving in the right direction.
ru: Отличай ложные цели от истинных. У тебя уже есть все, чтобы начать двигаться в нужном направлении.

# Tip.title.66
source: Do not overeat at night
ru: Не переедайте на ночь

# Tip.text.66
source: The body will not have to spend energy on digesting food during sleep, and you will rest better and faster.
ru: Организму не придется тратить силы на переваривание пищи во время сна, и вы отдохнете лучше и быстрее.

# Tip.title.67
source: Do some exercise
ru: Делайте зарядку

# Tip.text.67
source: Fifteen minutes for the simplest exercises. This way you will wake up faster.
ru: Пятнадцать минут на самые простые упражнения. Так вы быстрее проснетесь.

# Tip.title.68
source: Don't be afraid to repeat yourself!
ru: Не бойтесь повторяться!

# Tip.text.68
source: The famous photographer Cartier-Bresson said that his first 10,000 pictures were the worst. And there's only one way to make the good ones: make the bad ones first. And don't stop.
ru: Знаменитый фотограф Картье-Брессон говорил, что его первые 10 000 снимков были самыми плохими. И сделать хорошие можно только одним способом: сперва делать плохие. И не останавливаться.

# Tip.title.69
source: Happiness loves silence
ru: Счастье любит тишину

# Tip.text.69
source: A detailed broadcast of your life in social networks can give rise to envious and ill-wishers. Choose carefully what you want to share and with whom.
ru: Подробная трансляция своей жизни в соцсетях может породить завистников и недоброжелателей. Тщательно выбирайте, чем и с кем вы хотите поделиться.

# Tip.title.70
source: Watch your speech
ru: Следите за речью

# Tip.text.70
source: It is better to keep silent if there is nothing to say. Avoid parasitic words. Formulate a thought before you express it. Your interlocutor will definitely appreciate this.
ru: Лучше промолчать, если нечего сказать. Избегайте слов-паразитов. Формулируйте мысль, прежде чем ее высказать. Ваш собеседник точно оценит это.

# Tip.title.71
source: Fill the river drop by drop
ru: Наполняй реку по капле

# Tip.text.71
source: Invest your energy, funds, and thoughts only in the goal that will bring you satisfaction. Ask those who have already passed this path to tell about their discoveries and failures.
ru: Вкладывай энергию, средства и мысли только в ту цель, которая принесет тебе удовлетворение. Проси тех, кто уже проходил этот путь, рассказать о своих открытиях и провалах.

# Tip.title.72
source: Draw your happy day
ru: Нарисуйте свой счастливый день

# Tip.text.72
source: Find time and a quiet place, and describe your perfect day in the future. This will let you know what you really want right now.
ru: Найдите время и спокойное место, и опишите свой идеальный день в будущем. Это даст понять, чего вы действительно сейчас хотите.

# Tip.title.73
source: Do not rush to conclusions
ru: Не спешите с выводами

# Tip.text.73
source: If you can find out the reason for what is happening, please specify. Do not make hasty decisions, do not decide for others.
ru: Если есть возможность узнать причину того, что происходит — уточните. Не принимайте поспешных решений, не решайте за других.

# Tip.title.74
source: And it will pass
ru: И это пройдёт

# Tip.text.74
source: If you are doing well now. Or things aren't going the way we'd like them to. Remember one simple thing — and it will pass.
ru: Если у вас сейчас всё хорошо. Или всё идёт не так, как хотелось бы. Помните одну простую вещь — и это пройдёт.

# Tip.title.75
source: Say no to unnecessary information
ru: Скажите нет лишней информации
